[
  {
    "id": 1,
    "name": "Full Body Strength",
    "category": "Strength Training",
    "description": "A well-rounded strength training routine that targets all major muscle groups.",
    "instructions": "Perform each exercise with proper form, resting for 60-90 seconds between sets. Adjust weights as needed.",
    "exercises": [
      {
        "name": "Push-ups",
        "description": "A bodyweight exercise that strengthens the chest, shoulders, and triceps.",
        "sets": "3 sets of 15 reps",
        "instructions": "Keep your body straight, lower your chest to just above the floor, and push back up."
      },
      {
        "name": "Barbell Squat",
        "description": "A compound lower body exercise that engages the quadriceps, hamstrings, and glutes.",
        "sets": "4 sets of 10 reps",
        "instructions": "Keep feet shoulder-width apart, lower yourself by bending your knees, then push back up through your heels."
      },
      {
        "name": "Deadlifts",
        "description": "An exercise that targets the posterior chain, including hamstrings, glutes, and lower back.",
        "sets": "3 sets of 8 reps",
        "instructions": "Keep your back straight, hinge at your hips, and lift the bar by engaging your glutes and hamstrings."
      },
      {
        "name": "Pull-ups",
        "description": "A bodyweight exercise that builds back and biceps strength.",
        "sets": "3 sets of 8 reps",
        "instructions": "Grip the bar shoulder-width apart, pull yourself up until your chin is over the bar, and lower slowly."
      }
    ]
  },
  {
    "id": 2,
    "name": "Upper Body Hypertrophy",
    "category": "Muscle Growth",
    "description": "A workout designed for upper body muscle growth and endurance.",
    "instructions": "Use moderate to heavy weights, focusing on controlled movements. Rest for 45-60 seconds between sets.",
    "exercises": [
      {
        "name": "Dumbbell Shoulder Press",
        "description": "An overhead press that targets the deltoid muscles.",
        "sets": "3 sets of 12 reps",
        "instructions": "Keep your core engaged, press the dumbbells overhead, and slowly lower them back to shoulder level."
      },
      {
        "name": "Incline Bench Press",
        "description": "A variation of the bench press focusing on the upper chest.",
        "sets": "4 sets of 10 reps",
        "instructions": "Set the bench at a 30-45 degree angle, lower the bar to your chest, and press it back up."
      },
      {
        "name": "Bicep Curls",
        "description": "An isolated exercise for strengthening the biceps.",
        "sets": "3 sets of 15 reps",
        "instructions": "Keep your elbows close to your body and curl the dumbbells up without swinging."
      },
      {
        "name": "Tricep Dips",
        "description": "A bodyweight movement that strengthens the triceps.",
        "sets": "3 sets of 10 reps",
        "instructions": "Lower yourself until your elbows are at a 90-degree angle, then push yourself back up."
      }
    ]
  },
  {
    "id": 3,
    "name": "Lower Body Power",
    "category": "Strength & Conditioning",
    "description": "A workout designed to build lower body strength and power.",
    "instructions": "Focus on explosive movements and good form. Rest for 60-90 seconds between sets.",
    "exercises": [
      {
        "name": "Bulgarian Split Squat",
        "description": "A single-leg squat variation that increases balance and lower body strength.",
        "sets": "3 sets of 12 reps per leg",
        "instructions": "Place your back foot on a bench, lower yourself until your front thigh is parallel to the floor, then push back up."
      },
      {
        "name": "Romanian Deadlifts",
        "description": "A deadlift variation targeting hamstrings and glutes.",
        "sets": "3 sets of 10 reps",
        "instructions": "Hinge at the hips while keeping your back straight, lower the bar down your legs, and return to standing."
      },
      {
        "name": "Calf Raises",
        "description": "A simple exercise for strengthening the calf muscles.",
        "sets": "3 sets of 20 reps",
        "instructions": "Stand on the balls of your feet and lift your heels as high as possible before lowering back down."
      }
    ]
  },
  {
    "id": 4,
    "name": "Cardio Blast",
    "category": "Cardio",
    "description": "A high-intensity cardio workout to boost endurance and burn calories.",
    "instructions": "Perform each exercise with maximum effort, resting for 30 seconds between rounds.",
    "exercises": [
      {
        "name": "Jump Rope",
        "description": "A full-body cardio exercise that improves agility and endurance.",
        "sets": "3 rounds of 1 minute",
        "instructions": "Keep your core tight and jump continuously at a steady pace."
      },
      {
        "name": "Burpees",
        "description": "A high-intensity movement that works the entire body.",
        "sets": "3 sets of 12 reps",
        "instructions": "Drop into a squat, jump into a push-up position, perform a push-up, then jump back up explosively."
      },
      {
        "name": "Mountain Climbers",
        "description": "A dynamic movement that targets core and cardio endurance.",
        "sets": "3 sets of 30 seconds",
        "instructions": "Keep your core tight and drive your knees toward your chest in a running motion."
      }
    ]
  },
  {
    "id": 5,
    "name": "Core & Abs",
    "category": "Core Training",
    "description": "A workout designed to strengthen the core and improve stability.",
    "instructions": "Perform each exercise with control, resting for 30-45 seconds between sets.",
    "exercises": [
      {
        "name": "Plank",
        "description": "An isometric exercise that builds core endurance.",
        "sets": "3 rounds of 45 seconds",
        "instructions": "Keep your body in a straight line and engage your core throughout."
      },
      {
        "name": "Russian Twists",
        "description": "A rotational core exercise targeting the obliques.",
        "sets": "3 sets of 20 reps (10 per side)",
        "instructions": "Keep your feet off the floor and twist your torso side to side."
      },
      {
        "name": "Leg Raises",
        "description": "An exercise that strengthens the lower abs.",
        "sets": "3 sets of 15 reps",
        "instructions": "Keep your lower back on the floor and raise your legs to 90 degrees before lowering them slowly."
      }
    ]
  },
  {
    "id": 6,
    "name": "Mobility & Stretching",
    "category": "Recovery",
    "description": "A stretching routine to improve flexibility and mobility.",
    "instructions": "Hold each stretch for 20-30 seconds, breathing deeply.",
    "exercises": [
      {
        "name": "Downward Dog",
        "description": "A yoga stretch that improves hamstring and shoulder flexibility.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Push your hips back, straighten your legs, and press your heels toward the ground."
      },
      {
        "name": "Hip Flexor Stretch",
        "description": "A stretch for the hip flexors and quadriceps.",
        "sets": "3 rounds of 30 seconds per side",
        "instructions": "Kneel on one knee, push your hips forward, and hold."
      }
    ]
  },
  {
    "id": 7,
    "name": "Athletic Performance",
    "category": "Sports Training",
    "description": "A workout focused on improving speed, agility, and explosiveness.",
    "instructions": "Perform each exercise with intensity, resting for 45-60 seconds between sets.",
    "exercises": [
      {
        "name": "Box Jumps",
        "description": "An explosive movement to build lower body power.",
        "sets": "3 sets of 12 reps",
        "instructions": "Jump onto a sturdy box, landing softly, then step down."
      },
      {
        "name": "Sled Push",
        "description": "A full-body movement for developing speed and endurance.",
        "sets": "3 rounds of 20 meters",
        "instructions": "Keep your back straight, lean forward, and push the sled as fast as possible."
      },
      {
        "name": "Lateral Cone Drills",
        "description": "A drill to improve agility and lateral movement.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Move side to side quickly, touching each cone in a controlled manner."
      }
    ]
  },
  {
    "id": 8,
    "name": "Bodyweight HIIT",
    "category": "High-Intensity Interval Training",
    "description": "A fast-paced bodyweight workout to burn fat and increase endurance.",
    "instructions": "Perform each exercise with full intensity for 30 seconds, then rest for 15 seconds.",
    "exercises": [
      {
        "name": "Jump Squats",
        "description": "A squat variation that builds explosive strength.",
        "sets": "3 sets of 30 seconds",
        "instructions": "Lower into a squat and explode upward, landing softly."
      },
      {
        "name": "Plank to Shoulder Taps",
        "description": "A dynamic core and stability exercise.",
        "sets": "3 sets of 30 seconds",
        "instructions": "Hold a plank and alternate tapping your shoulders with opposite hands."
      },
      {
        "name": "Lunges",
        "description": "A unilateral movement for leg strength and balance.",
        "sets": "3 sets of 12 reps per leg",
        "instructions": "Step forward, lower until your back knee is just above the ground, and push back up."
      }
    ]
  },
  {
    "id": 9,
    "name": "Endurance Training",
    "category": "Cardio & Stamina",
    "description": "A workout focused on building cardiovascular endurance and stamina.",
    "instructions": "Maintain a steady pace, focusing on consistency and breathing.",
    "exercises": [
      {
        "name": "Treadmill Running",
        "description": "A steady-state cardio workout to improve endurance.",
        "sets": "30 minutes at moderate intensity",
        "instructions": "Run at a steady pace, keeping your breathing controlled."
      },
      {
        "name": "Rowing Machine",
        "description": "A full-body cardio exercise that targets endurance.",
        "sets": "4 rounds of 5 minutes",
        "instructions": "Row at a steady pace, focusing on smooth strokes."
      },
      {
        "name": "Cycling",
        "description": "A low-impact endurance exercise.",
        "sets": "45 minutes at moderate intensity",
        "instructions": "Keep a consistent cadence and adjust resistance as needed."
      }
    ]
  },
  {
    "id": 10,
    "name": "Flexibility & Yoga",
    "category": "Recovery & Mobility",
    "description": "A routine designed to improve flexibility, reduce stress, and aid recovery.",
    "instructions": "Hold each position for 20-30 seconds, breathing deeply.",
    "exercises": [
      {
        "name": "Child’s Pose",
        "description": "A relaxation stretch for the back and hips.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Sit back onto your heels, stretch your arms forward, and relax."
      },
      {
        "name": "Seated Forward Fold",
        "description": "A hamstring and lower back stretch.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Sit with legs extended and reach forward toward your toes."
      },
      {
        "name": "Cat-Cow Stretch",
        "description": "A mobility movement for spinal flexibility.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Alternate between arching and rounding your back in a smooth motion."
      }
    ]
  },
  {
    "id": 11,
    "name": "Plyometric Training",
    "category": "Power & Agility",
    "description": "A high-intensity workout focused on explosive movements to improve power and agility.",
    "instructions": "Perform each exercise explosively, resting for 60 seconds between sets.",
    "exercises": [
      {
        "name": "Box Jumps",
        "description": "Jump onto a sturdy box to build explosive leg power.",
        "sets": "4 sets of 10 reps",
        "instructions": "Stand in front of the box, jump up, and land softly with knees slightly bent."
      },
      {
        "name": "Clap Push-ups",
        "description": "An advanced push-up variation that builds upper body power.",
        "sets": "3 sets of 8 reps",
        "instructions": "Lower into a push-up and explode upward to clap your hands before landing."
      },
      {
        "name": "Tuck Jumps",
        "description": "A jump that engages the core and improves leg power.",
        "sets": "3 sets of 12 reps",
        "instructions": "Jump as high as possible, bringing your knees to your chest."
      }
    ]
  },
  {
    "id": 12,
    "name": "Circuit Training",
    "category": "Full Body Conditioning",
    "description": "A fast-paced workout combining strength and cardio exercises.",
    "instructions": "Perform each exercise for 45 seconds, resting for 15 seconds between exercises. Complete 3 rounds.",
    "exercises": [
      {
        "name": "Kettlebell Swings",
        "description": "A dynamic movement that targets the posterior chain.",
        "sets": "3 rounds of 45 seconds",
        "instructions": "Swing the kettlebell between your legs and thrust your hips forward to swing it up."
      },
      {
        "name": "Battle Ropes",
        "description": "A full-body workout that improves strength and endurance.",
        "sets": "3 rounds of 45 seconds",
        "instructions": "Wave the ropes up and down as quickly as possible."
      },
      {
        "name": "Medicine Ball Slams",
        "description": "A powerful movement that engages the core and upper body.",
        "sets": "3 rounds of 45 seconds",
        "instructions": "Lift the medicine ball overhead and slam it down to the ground with force."
      }
    ]
  },
  {
    "id": 13,
    "name": "Yoga Flow",
    "category": "Mind & Body",
    "description": "A dynamic yoga routine to improve flexibility, strength, and mindfulness.",
    "instructions": "Move through each pose fluidly, holding each for 5 breaths.",
    "exercises": [
      {
        "name": "Warrior II",
        "description": "A standing pose that strengthens the legs and opens the hips.",
        "sets": "3 rounds of 5 breaths per side",
        "instructions": "Stand with legs wide, bend one knee, and extend arms parallel to the ground."
      },
      {
        "name": "Tree Pose",
        "description": "A balancing pose that improves stability and focus.",
        "sets": "3 rounds of 5 breaths per side",
        "instructions": "Stand on one leg, place the other foot on your inner thigh, and raise your arms overhead."
      },
      {
        "name": "Cobra Pose",
        "description": "A backbend that stretches the chest and strengthens the spine.",
        "sets": "3 rounds of 5 breaths",
        "instructions": "Lie on your stomach, place hands under shoulders, and lift your chest while keeping hips down."
      }
    ]
  },
  {
    "id": 14,
    "name": "Agility Ladder Drills",
    "category": "Speed & Agility",
    "description": "A workout focused on improving foot speed and coordination using an agility ladder.",
    "instructions": "Perform each drill for 30 seconds, resting for 15 seconds between drills.",
    "exercises": [
      {
        "name": "In-and-Outs",
        "description": "Step in and out of the ladder with quick feet.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Start outside the ladder, step in with both feet, then step out."
      },
      {
        "name": "Lateral Shuffles",
        "description": "Move sideways through the ladder to improve lateral speed.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Shuffle sideways, placing one foot in each square of the ladder."
      },
      {
        "name": "Single-Leg Hops",
        "description": "Hop through the ladder on one leg to build balance and strength.",
        "sets": "3 rounds of 30 seconds per leg",
        "instructions": "Hop on one leg, landing softly in each square."
      }
    ]
  },
  {
    "id": 15,
    "name": "Bodyweight Strength",
    "category": "Strength Training",
    "description": "A workout using bodyweight exercises to build strength and endurance.",
    "instructions": "Perform each exercise for 3 sets, resting for 60 seconds between sets.",
    "exercises": [
      {
        "name": "Pistol Squats",
        "description": "A challenging single-leg squat that builds leg strength.",
        "sets": "3 sets of 5 reps per leg",
        "instructions": "Lower into a squat on one leg while extending the other leg forward."
      },
      {
        "name": "Handstand Push-ups",
        "description": "An advanced bodyweight exercise targeting shoulders and triceps.",
        "sets": "3 sets of 5 reps",
        "instructions": "Kick up into a handstand against a wall and lower your head to the ground."
      },
      {
        "name": "Burpee Pull-ups",
        "description": "A combination of burpees and pull-ups for full-body strength.",
        "sets": "3 sets of 8 reps",
        "instructions": "Perform a burpee, then jump up to a pull-up bar and complete a pull-up."
      }
    ]
  },
  {
    "id": 16,
    "name": "Kettlebell Conditioning",
    "category": "Strength & Endurance",
    "description": "A workout using kettlebells to build strength and cardiovascular endurance.",
    "instructions": "Perform each exercise for 30 seconds, resting for 15 seconds between exercises.",
    "exercises": [
      {
        "name": "Kettlebell Goblet Squats",
        "description": "A squat variation that targets the legs and core.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Hold the kettlebell close to your chest and squat down, keeping your back straight."
      },
      {
        "name": "Kettlebell Snatch",
        "description": "An explosive movement that builds power and coordination.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Swing the kettlebell between your legs and snatch it overhead in one motion."
      },
      {
        "name": "Kettlebell Russian Twists",
        "description": "A core exercise that targets the obliques.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Sit on the ground, lean back slightly, and twist the kettlebell side to side."
      }
    ]
  },
  {
    "id": 17,
    "name": "HIIT Cardio",
    "category": "High-Intensity Interval Training",
    "description": "A high-intensity cardio workout to improve cardiovascular fitness and burn fat.",
    "instructions": "Perform each exercise for 20 seconds at maximum effort, followed by 10 seconds of rest. Complete 4 rounds.",
    "exercises": [
      {
        "name": "High Knees",
        "description": "A cardio exercise that engages the core and legs.",
        "sets": "4 rounds of 20 seconds",
        "instructions": "Run in place, bringing your knees up to hip level as quickly as possible."
      },
      {
        "name": "Skaters",
        "description": "A lateral movement that improves agility and coordination.",
        "sets": "4 rounds of 20 seconds",
        "instructions": "Jump side to side, landing on one foot and bringing the other leg behind."
      },
      {
        "name": "Burpee Tuck Jumps",
        "description": "A combination of burpees and tuck jumps for a full-body workout.",
        "sets": "4 rounds of 20 seconds",
        "instructions": "Perform a burpee, then jump up and tuck your knees to your chest."
      }
    ]
  },
  {
    "id": 18,
    "name": "Strength Endurance",
    "category": "Muscle Endurance",
    "description": "A workout designed to improve muscular endurance through high-rep exercises.",
    "instructions": "Perform each exercise for 15-20 reps, resting for 30-45 seconds between sets.",
    "exercises": [
      {
        "name": "Dumbbell Lunges",
        "description": "A lower body exercise that targets the quads and glutes.",
        "sets": "3 sets of 15 reps per leg",
        "instructions": "Step forward into a lunge, keeping your front knee over your ankle."
      },
      {
        "name": "Push-up Variations",
        "description": "Different push-up variations to target various muscle groups.",
        "sets": "3 sets of 15 reps",
        "instructions": "Alternate between standard, wide, and diamond push-ups."
      },
      {
        "name": "Dumbbell Rows",
        "description": "A back exercise that strengthens the upper body.",
        "sets": "3 sets of 15 reps per arm",
        "instructions": "Bend at the hips, keep your back straight, and pull the dumbbell towards your hip."
      }
    ]
  },
  {
    "id": 19,
    "name": "Outdoor Bootcamp",
    "category": "Functional Training",
    "description": "A full-body workout using bodyweight and outdoor elements.",
    "instructions": "Perform each exercise for 45 seconds, resting for 15 seconds between exercises. Complete 3 rounds.",
    "exercises": [
      {
        "name": "Park Bench Dips",
        "description": "A bodyweight exercise that targets the triceps.",
        "sets": "3 rounds of 45 seconds",
        "instructions": "Use a park bench to lower and raise your body using your arms."
      },
      {
        "name": "Hill Sprints",
        "description": "A high-intensity cardio exercise that builds speed and endurance.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Sprint up a hill as fast as you can, then walk back down to recover."
      },
      {
        "name": "Tire Flips",
        "description": "A functional strength exercise that engages the entire body.",
        "sets": "3 rounds of 10 flips",
        "instructions": "Flip a heavy tire over using your legs and back."
      }
    ]
  },
  {
    "id": 20,
    "name": "Balance & Stability",
    "category": "Core & Stability",
    "description": "A workout focused on improving balance and core stability.",
    "instructions": "Perform each exercise for 30 seconds, resting for 15 seconds between exercises.",
    "exercises": [
      {
        "name": "Single-Leg Deadlifts",
        "description": "A balance exercise that targets the hamstrings and glutes.",
        "sets": "3 rounds of 30 seconds per leg",
        "instructions": "Stand on one leg, hinge at the hips, and lower your torso while extending the other leg back."
      },
      {
        "name": "BOSU Ball Squats",
        "description": "A squat variation that improves balance and stability.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Stand on a BOSU ball and perform squats, keeping your core engaged."
      },
      {
        "name": "Plank with Leg Lift",
        "description": "A core exercise that challenges stability.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Hold a plank position and lift one leg at a time, keeping your hips level."
      }
    ]
  }
]
